{"summary":"Markov chain nonsense from the desk of Dwight, Michael and Harry","date":"19/12/2020","externalLink":"https://lyricalnonsense.netlify.app","isLong":"false","images":[{"type":"image","value":{"src":"https://raw.githubusercontent.com/fergaldoyle/image-masonry/master/docs/masonry.jpg","alt":"Family Photo"}},{"type":"image","value":{"src":"https://pbs.twimg.com/profile_banners/887650017040752640/1637580215/1500x500","alt":"Family Photo"}}],"text":[{"type":"text","value":"I’ve not watched The Office beyond 5 episodes, and I started listening to Harry Styles at the request of my friend. Given that these two things are not something I am particularly protective about or wary of desecrating, I found them to be the ideal candidates for a project I had in mind for a long time; creating shareable, auto-generated GIFs based on Markov Chains."},{"type":"text","value":"While a useless project in itself, I learnt a lot through the process. This had me <a class='link' href='/projects/songscrapr' sveltekit:prefetch> collect data using a package I wrote </a>, creating a script to generate Markov chains based on the entity (Michael, Harry or Dwight), using the GIPHY API to fetch a somewhat-relevant GIF and then combining these things into a neat email that would be sent to whoever signs up for 1 year."},{"type":"text","value":"<div style=\"width:100%;height:0;padding-bottom:83%;position:relative;\"><iframe src=\"https://giphy.com/embed/94Tn4d5g4gisx4uaUy\" width=\"100%\" height=\"100%\" style=\"position:absolute\" frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe></div><p><a href=\"https://giphy.com/gifs/94Tn4d5g4gisx4uaUy\">via GIPHY</a></p>"},{"type":"text","value":"I used R for data collection and cleaning, and Python for automating the GIF generation using the GIPHY, markovify and Pillow libraries and for creating the HTML emails too."},{"type":"text","value":"The results are an amusing collection of silly GIFs (some of which are, er, questionable) shared via an automated newsletter. I’ve compiled the output into a website, go generate some nonsense!"}]}