{"title":"Srishti Archive","summary":"A permanent gallery of projects by students at Srishti.","date":"19/12/2020","isLong":"false","images":[{"type":"image","value":{"src":"https://raw.githubusercontent.com/fergaldoyle/image-masonry/master/docs/masonry.jpg","alt":"Family Photo"}},{"type":"image","value":{"src":"https://pbs.twimg.com/profile_banners/887650017040752640/1637580215/1500x500","alt":"Family Photo"}}],"text":[{"type":"text","value":"Our work in Srishti is ephemeral. We work on projects for 4 weeks and save an exhibition that might or might not happen, this work remains inside that particular studio or class. Once this class is over, the work of weeks is lost and sits on our hard-drives (and maybe on a Behance profile, if we feel so inclined). For every unit, we have to reinvent the wheel and start, and work in ignorance of all that has been done before us and don the same veil of isolation (that we pass to those who will come after us). For instance, according to my exploration, there are approximately 155 surveys created over two years in Srishti, just in one batch. Where do the results of those surveys go? Should a student who is working on a project that might benefit from that data conduct the same survey and waste time, or should they hit the ground running and benefit from work done before them to create something better? The entire philosophy of the open-source movement is based on the ability to access and draw from previous work. Within the constraints of a 5 week class, if we are able to create work that is deeper in its understanding and utilizes previous knowledge to the fullest, it is beneficial for the students as well as the facilitators and the institution at large."},{"type":"text","value":"<i> If resources on the internet in the form of blogs, research papers and videos can form the basis of our secondary research, why do we neglect the body of work that is being produced everyday in our own institution? Why can't that be the foundation on which we build as well? </i>"},{"type":"text","value":"Keeping the above problems in mind, which are based on my experience in the Co-Create Studio (UGPP Year 2, Venkat Chilikuri), I have developed a no-cost means to document and archive student projects and create the infrastructure to make them searchable and discoverable across multiple categories, available as a web-app. This has numerous advantages, principally encouraging meaningful appropriation and increasing the diversity of our creative output by facilitating the cross-pollination of ideas and processes."},{"type":"text","value":"The Srishti Archive aims to create a living, common pool of knowledge shared across years. A permanent gallery of projects by students at Srishti, with permissive licenses that allows derivative work."}]}