{"headline":"So, internships, huh?","text1":"An internship will undoubtedly be your most exciting time at Srishti (because you’ll not be in Srishti lol). While it may seem daunting, the process doesn’t have to be scary. I’ve listed out some basic things to keep in mind while building your portfolio and applying to places that helped me (I don’t know what it’ll do for you, but oh well).","points":[{"heading":"Don’t work for a portfolio.","text":"If you treat your work like a chore, it shows. A portfolio doesn’t mean you need to have X amount of UX case studies, Y amount of screens and Z amount of jargon. Embrace personal projects, work on what excites you. My biggest portfolio pieces were built not with the end goal of having it in my portfolio but because I wanted to create something for myself. Don’t worry if it doesn’t align with your major, nobody outside Yelahanka gives a shit about what CAC or BSSD mean. My friend from IAIDP successfully interned in animation. Do what you like, work is work."},{"heading":"There’s no required amount of projects.","text":"Two or three good, detailed projects are better than five bleh ones. Quality over quantity always."},{"heading":"Start with a bang","text":"Attention spans are short. Order your projects in a way that showcases your strongest skills for what you’re applying first. You can rearrange the same portfolio to give importance to what the company might be looking for, but always start with the strongest projects."},{"heading":"Show them what you can do.","text":"Even if you’re applying for a UI/UX internship, don’t shy away from putting in your Blender or illustration work. Managers want people with a wide array of skills, don’t worry about ‘relevance’ too much."},{"heading":"In most cases, nobody is reading your 15 page case study.","text":"I’m going to let people better than me take you through this. <a href=\"https://vanschneider.com/blog/portfolio-tips/the-old-case-study-is-not-working/\" class=\"link\">Here ya go.</a> Beware that this is highly subjective. BSSD and other aspects of HCD might require you to document your process, but there are ways to do that creatively."},{"heading":"Get feedback. Use it. But also know what to take from it.","text":"Show your friends your projects, ask for critical feedback and learn to accept that you can do better. Font sucks? Change it. Your explanation isn’t clear enough? Rewrite. Don’t let your ego get in the way of improvements. If you find yourself explaining why you did something that more than 3 people can’t understand, reconsider. If it needs your verbal justification, it's not good enough. Recruiters aren’t going to ponder your work like contemporary arts faculty. But at the same time, stick to your guns when you feel like you really need to and learn when to ignore comments. Log kahenge, logon ka kaam hai kehna."},{"heading":"Website? BEHANCE? PDF? Illustrator? Indesign?????? WHAT DO I USE?","text":"Dude relax. Context matters. Applying for a coding internship? Website is a no-brainer. Film? You’re not going to be sending a zine then are you. Most other places are happy with a PDF. I made my portfolio in half an hour on Canva. As long as your content is in place, the medium shouldn’t matter a whole lot. If you’re making a website, look up Webflow, Wix, Squarespace and My Portfolio. If you’re making a website, be professional and buy a domain. This website is hand-coded."},{"heading":"You don’t need to pregame.","text":"Your third year internship can be your only one. That is fine. Your 2nd and 3rd year are for skill-development, not for burnouts. Don’t compare yourself to other people who seem to have done 56 internships by their 3rd semester. Reject toxic hustle culture and work at your own pace."},{"heading":"Apply early.","text":"Do not wait. No portfolio is finished, nobody is perfect. Stop stalling because of perfectionism. Apply by the third week of February at the latest. It takes a good 1.5 months for things to become finalized and you need this buffer to make sure you aren’t stranded with nothing. Early bird becomes an intern."},{"heading":"Look for learning not a sweatshop.","text":"A good internship is one where you learn and expand your creative skillset. In your application, state what you can do and what you want to learn. Don’t settle for places that will not challenge you, don’t be stuck doing things that don’t excite you. A lot of places on LinkedIn and Internshala look for help with labour under the guise of internships. Stay away. It is also okay to reject an internship even if you got accepted. Otherwise, you might end up making just social media posts for two months."},{"heading":"Get out of LinkedIn hell.","text":"Most places don’t put out internship calls. While LinkedIn, Internshala and company websites are great, they’re not your only source of internships. I got my internship through Twitter. I also emailed nearly 15 people, looked in relevant Slack and Discord channels, cold called, tweeted and nearly sent out a pigeon. Even if a company doesn’t have a listing for an intern, they might create one just for you. Worst you can get is a no. <a href=\"https://gist.github.com/thedivtagguy/f26d6eca08681b0f2ab485260d61c693\" class=\"link\">Some email templates for you here.</a>","tweet":"<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hello! I am looking for summer internships in a newsroom or an online publication for a dataviz role. I am experienced in R, Python and frontend web development, and I enjoy research and writing. If you or someone you know is looking for such an intern, please tag or RT. <a href=\"https://t.co/wXNFnc6IUH\">pic.twitter.com/wXNFnc6IUH</a></p>&mdash; Aman Bhargava 🦕 (@thedivtagguy) <a href=\"https://twitter.com/thedivtagguy/status/1490722911853834243?ref_src=twsrc%5Etfw\">February 7, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>","caption":"Traditional ways aren’t the only ones."},{"heading":"KISS","text":"Keep it simple, stupid. Simple resumes are the best ones. Recruiters and managers don’t want to navigate The Last Supper just to know what you’re good at. <a href=\"https://thedivtagguy.com/contact\" class=\"link\">Refer to my ugly-ass resume here. It works. That is all you need.</a>"},{"heading":"Ask for help","text":"Reach out to seniors in your major and ask them to review your portfolio. My advice for data viz might not apply to your VCSB or IADP needs; ask the relevant people. Need a portfolio review for coding or data viz? I’m ready to help. Email me at amanbhargava2001[at]gmail.com or <a href=\"https://www.instagram.com/thedivtagguy/\" class=\"link\">drop a DM on Instagram.</a> All the best."}]}